Конфигурация/Documents/ОсуществлениеПраваГолосаПоЦеннымБумагам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ОсуществлениеПраваГолосаПоЦеннымБумагам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГолосованияНаСобранияхВладельцевЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГолосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобранияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобранияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовесткаДня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыПовестки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВопросПовесткиДня</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантГолосования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыГолосования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ОсуществлениеПраваГолосаПоЦеннымБумагам/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Подключение стандартных механизмов (в т.ч. команды работы с присоединенными файлами - "скрепка")
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;

	ЗагрузитьКлиентовИзОбъекта();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ЗагрузитьКлиентовИзОбъекта();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Хранится только счет ДУ; клиент и вид договора не сохраняются (расчетные)
	ТекущийОбъект.Клиенты.Очистить();
	Для Каждого СтрокаФормы Из Клиенты Цикл
		Если Не ЗначениеЗаполнено(СтрокаФормы.СчетДоверительногоУправления) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТекущийОбъект.Клиенты.Добавить();
		НоваяСтрока.СчетДоверительногоУправления = СтрокаФормы.СчетДоверительногоУправления;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапки

&НаКлиенте
Процедура ДатаГолосованияПриИзменении(Элемент)

	// При смене даты голосования обновим расчетные данные клиентов (клиент/вид договора на дату)
	Если Клиенты.Количество() > 0 Тогда
		ЗаполнитьДанныеКлиентов();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыКлиенты

&НаКлиенте
Процедура КлиентыСчетДоверительногоУправленияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьДаннымиСтрокуКлиента(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКлиентов(Команда)

	Если Не ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана ценная бумага",, "Объект.ЦеннаяБумага");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ДатаГолосования) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата голосования",, "Объект.ДатаГолосования");
		Возврат;
	КонецЕсли;

	Если Клиенты.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьКлиентовЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Список клиентов будет очищен и заполнен заново. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьКлиентовНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлиентовЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьКлиентовНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьКлиентовПоВидуДоговора(Команда)

	Если Клиенты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СписокВидов = Новый СписокЗначений;
	Для Каждого СтрокаКлиент Из Клиенты Цикл
		Если ЗначениеЗаполнено(СтрокаКлиент.ВидДоговора)
			И СписокВидов.НайтиПоЗначению(СтрокаКлиент.ВидДоговора) = Неопределено Тогда
			СписокВидов.Добавить(СтрокаКлиент.ВидДоговора, Строка(СтрокаКлиент.ВидДоговора));
		КонецЕсли;
	КонецЦикла;

	Если СписокВидов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В списке клиентов не заполнен вид договора");
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("УдалитьКлиентовПоВидуДоговораЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокВидов, Элементы.КлиентыУдалитьПоВидуДоговора);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьКлиентовПоВидуДоговораЗавершение(ВыбранныйЭлемент, ДопПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УдалитьСтрокиКлиентовПоВидуДоговораНаСервере(ВыбранныйЭлемент.Значение);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Переносит счета ДУ из табличной части объекта в реквизит формы "Клиенты"
// и достраивает расчетные колонки (клиент, вид договора).
&НаСервере
Процедура ЗагрузитьКлиентовИзОбъекта()

	Клиенты.Очистить();

	Для Каждого СтрокаТЧ Из Объект.Клиенты Цикл
		НоваяСтрока = Клиенты.Добавить();
		НоваяСтрока.СчетДоверительногоУправления = СтрокаТЧ.СчетДоверительногоУправления;
	КонецЦикла;

	ЗаполнитьДанныеКлиентов();

КонецПроцедуры

// Заполняет расчетные колонки (клиент, вид договора) по всем строкам таблицы клиентов.
&НаСервере
Процедура ЗаполнитьДанныеКлиентов()

	МассивСчетов = Новый Массив;
	Для Каждого СтрокаКлиент Из Клиенты Цикл
		Если ЗначениеЗаполнено(СтрокаКлиент.СчетДоверительногоУправления) Тогда
			МассивСчетов.Добавить(СтрокаКлиент.СчетДоверительногоУправления);
		КонецЕсли;
	КонецЦикла;

	Если МассивСчетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДанныеСчетов = ПолучитьДанныеСчетов(МассивСчетов, Объект.ДатаГолосования);

	ПустойКлиент      = Справочники.ЮрФизЛица.ПустаяСсылка();
	ПустойВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ПустаяСсылка();

	Для Каждого СтрокаКлиент Из Клиенты Цикл
		Данные = ДанныеСчетов.Получить(СтрокаКлиент.СчетДоверительногоУправления);
		Если Данные <> Неопределено Тогда
			СтрокаКлиент.Клиент      = Данные.Клиент;
			СтрокаКлиент.ВидДоговора = Данные.ВидДоговора;
		Иначе
			СтрокаКлиент.Клиент      = ПустойКлиент;
			СтрокаКлиент.ВидДоговора = ПустойВидДоговора;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Заполняет расчетные колонки одной строки таблицы клиентов.
&НаСервере
Процедура ЗаполнитьДаннымиСтрокуКлиента(Идентификатор)

	СтрокаКлиент = Клиенты.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаКлиент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПустойКлиент      = Справочники.ЮрФизЛица.ПустаяСсылка();
	ПустойВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ПустаяСсылка();

	Если Не ЗначениеЗаполнено(СтрокаКлиент.СчетДоверительногоУправления) Тогда
		СтрокаКлиент.Клиент      = ПустойКлиент;
		СтрокаКлиент.ВидДоговора = ПустойВидДоговора;
		Возврат;
	КонецЕсли;

	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(СтрокаКлиент.СчетДоверительногоУправления);

	ДанныеСчетов = ПолучитьДанныеСчетов(МассивСчетов, Объект.ДатаГолосования);
	Данные = ДанныеСчетов.Получить(СтрокаКлиент.СчетДоверительногоУправления);

	Если Данные <> Неопределено Тогда
		СтрокаКлиент.Клиент      = Данные.Клиент;
		СтрокаКлиент.ВидДоговора = Данные.ВидДоговора;
	Иначе
		СтрокаКлиент.Клиент      = ПустойКлиент;
		СтрокаКлиент.ВидДоговора = ПустойВидДоговора;
	КонецЕсли;

КонецПроцедуры

// Возвращает соответствие: счет ДУ -> структура (Клиент, ВидДоговора) на указанную дату.
&НаСервереБезКонтекста
Функция ПолучитьДанныеСчетов(МассивСчетов, ДатаГолосования)

	Период = ?(ЗначениеЗаполнено(ДатаГолосования), КонецДня(ДатаГолосования), ТекущаяДатаСеанса());

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Счета.Ссылка КАК Счет,
		|	Счета.ВидДоговораДоверительногоУправления КАК ВидДоговора,
		|	ЕСТЬNULL(Клиенты.Клиент, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Клиент
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК Счета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК Клиенты
		|		ПО Счета.Ссылка = Клиенты.СчетДоверительногоУправления
		|ГДЕ
		|	Счета.Ссылка В (&МассивСчетов)";

	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("Период",       Период);

	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Данные = Новый Структура("Клиент, ВидДоговора", Выборка.Клиент, Выборка.ВидДоговора);
		Результат.Вставить(Выборка.Счет, Данные);
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьКлиентовНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Остатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Остатки.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора,
		|	СУММА(Остатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТОстаткиЦБ
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК Остатки
		|СГРУППИРОВАТЬ ПО
		|	Остатки.СчетДоверительногоУправления,
		|	Остатки.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления
		|ИМЕЮЩИЕ
		|	СУММА(Остатки.КоличествоОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстаткиЦБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(Клиенты.Клиент, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Клиент,
		|	ВТОстаткиЦБ.ВидДоговора КАК ВидДоговора
		|ИЗ
		|	ВТОстаткиЦБ КАК ВТОстаткиЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК Клиенты
		|		ПО ВТОстаткиЦБ.СчетДоверительногоУправления = Клиенты.СчетДоверительногоУправления
		|УПОРЯДОЧИТЬ ПО
		|	ВидДоговора,
		|	СчетДоверительногоУправления";

	Запрос.УстановитьПараметр("Период",       КонецДня(Объект.ДатаГолосования));
	Запрос.УстановитьПараметр("Организация",  Объект.Организация);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.ЦеннаяБумага);

	Клиенты.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Клиенты.Добавить();
		НоваяСтрока.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		НоваяСтрока.Клиент                       = Выборка.Клиент;
		НоваяСтрока.ВидДоговора                  = Выборка.ВидДоговора;
	КонецЦикла;

	Если Клиенты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не найдены клиенты с ненулевым остатком по выбранной ценной бумаге на дату голосования");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиКлиентовПоВидуДоговораНаСервере(ВидДоговора)

	СтрокиНаУдаление = Новый Массив;
	Для Каждого СтрокаКлиент Из Клиенты Цикл
		Если СтрокаКлиент.ВидДоговора = ВидДоговора Тогда
			СтрокиНаУдаление.Добавить(СтрокаКлиент);
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаКлиент Из СтрокиНаУдаление Цикл
		Клиенты.Удалить(СтрокаКлиент);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
